Revit 2027 API
ParameterTypeId.RoofStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofStructureIdParam { get; }
Public Shared ReadOnly Property RoofStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofStructureIdParam {
	ForgeTypeId^ get ();
}
static member RoofStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace